Revit 2026 API

# DocumentSiteLocation Property

---

Returns the site location information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SiteLocation SiteLocation { get; }
```
```vb
Public ReadOnly Property SiteLocation As SiteLocation
	Get
```
```cpp
public:
property SiteLocation^ SiteLocation {
	SiteLocation^ get ();
}
```
```fsharp
member SiteLocation : SiteLocation with get
```

#### Property Value

SiteLocation

The SiteLocation property returns an object that contains the site location for the entire project.

#### Reference

Document Class

Autodesk.Revit.DB Namespace